import string


alphabet = string.ascii_letters
message = "☣️💾🕯️ 🕸️🖤🖤📡🌩️🦉 ☣️💀☠️🕸️🕯️ 📟🌙 🕸️📟☢️🕯️. 💀🕸️🕸️ 💀⚰️☣️📟☢️🕯️ ⚰️🖤⛓️⛓️🌩️🦇📟⚰️💀☣️📟🖤🦇🌙 ⛓️🌩️🌙☣️ 🌙💾📟🩸☣️ ☣️🖤 ☣️💾📟🌙 🩸🖤🔮⛓️💀☣️ ☣️🖤 ☠️🧪🦉💀🌙🌙 🌙☣️💀🦇🪦💀🔮🪦 🌙☣️🔮📟🦇🦴 🌙⚰️💀🦇🦇🕯️🔮🌙.🪦📟🔮🕯️⚰️☣️ 🌙🧪⛓️☠️🖤🕸️ ⛓️💀🦉🦉📟🦇🦴? ☣️💾📟🌙 📟🌙 🌩️🦇💾📟🦇🦴🕯️🪦. 📟🩸 ☣️💾🕯️ 🪦🖤🖤⛓️🌙⚰️🔮🖤🕸️🕸️ 🩸📟🕸️☣️🕯️🔮 🔮🕯️🔌🕯️⚰️☣️🌙 🔮💀🔥 🌩️☣️🩸-8 📟🦇🌙🕯️🔮☣️🌙 🖤🔮 🌙🦉🕯️⚰️📟🩸📟⚰️ ☠️🕸️🖤⚰️📡🌙, ☣️💾🕯️ 🔥💾🖤🕸️🕯️ 🌙☣️🔮🕯️💀⛓️ 🔥📟🕸️🕸️ 🩸🔮🕯️🕯️🔏🕯️. 🔮🕯️🪦📟🔮🕯️⚰️☣️ 🕯️☢️🕯️🔮🧪☣️💾📟🦇🦴 🕸️🖤⚰️💀🕸️-🌙📟🪦🕯️ 🩸📟🔮🌙☣️ ☠️🕯️🩸🖤🔮🕯️ 🦉🖤🌙☣️📟🦇🦴📟☣️ 🌩️🌙🕯️🌙 🌙☣️💀🦇🪦💀🔮🪦 🌩️☣️🩸-8 🦉💀🔮💀⛓️🕯️☣️🕯️🔮🌙. ☣️💾🕯️ ☠️🕸️🖤⚰️📡🌙 🦉💀🔮🌙🕯️ 🌙💀🩸🕯️🕸️🧪 🔥📟☣️💾🖤🌩️☣️ ⚰️🖤🔮🔮🌩️🦉☣️📟🖤🦇🖤⛓️🦴 📟☣️'🌙 🕸️📟☣️🕯️🔮💀🕸️🕸️🧪 🔮🕯️🦇🪦🕯️🔮📟🦇🦴 🖤🦇 ⛓️🧪 🩸🕯️🕯️🪦 🦉🕯️🔮🩸🕯️⚰️☣️🕸️🧪 🕸️🖤🕸️ 🌙🦉🖤🖤📡 🔮🕯️💀🕸️🕸️🧪 ⚰️🖤🖤📡🕯️🪦 🔥📟☣️💾 ☣️💾📟🌙 🕸️💀🧪🖤🌩️☣️. 💾📟🦴💾 📡🕯️🧪 🦴🕯️🦇📟🌩️🌙 ☠️🕯️⚰️💀🌩️🌙🕯️ 🔮🕯️🦴🌩️🕸️💀🔮 🩸📟🔮🕯️🔥💀🕸️🕸️🌙 💀🔮🕯️ 🔌🌩️🌙☣️ 🦴🖤📟🦇🦴 ☣️🖤 ☣️💾📟🦇📡 🔥🕯️'🔮🕯️ 🌙🦉💀⛓️⛓️📟🦇🦴 🕯️⛓️🖤🔌📟🌙 📟🦇 💀 🦴🔮🖤🌩️🦉 ⚰️💾💀☣️ 📟🦇🌙☣️🕯️💀🪦 🖤🩸 🪦🔮🖤🦉🦉📟🦇🦴 💀⚰️☣️🌩️💀🕸️ 🦇🕯️☣️🔥🖤🔮📡 ☢️💀🔮📟💀☠️🕸️🕯️🌙🌙🖤 🌩️ ☣️🕯️🕸️🕸️📟🦇 ⛓️🕯️ 📟 🦴🖤☣️☣️💀 ⚰️🖤🦉🧪 🦉💀🌙☣️🕯️ ☣️💾🕯️🌙🕯️ 🌙🧪⛓️☠️🖤🕸️🌙 🦇🖤🔥 ☣️🖤 ☣️💀🕸️📡 ☣️🖤 🌩️ 🦴🌩️🧪🌙? 💀☠️🌙🖤🕸️🌩️☣️🕯️ 🦴🖤🕸️🪦. 📟🩸 📟 🌙🕯️🦇🪦 💀 ☠️🔮🖤📡🕯️🦇 🌙🧪⛓️☠️🖤🕸️ 🪦🖤🕯️🌙 ☣️💾🕯️ 🕯️🦇🦴📟🦇🕯️ ⚰️🔮💀🌙💾 🖤🔮 🪦🖤 📟 🔌🌩️🌙☣️ 🕸️🖤🖤📡 🌙☣️🌩️🦉📟🪦? 🕸️📟🦇📡 ☣️💾🕯️ ☣️🔮💀🦇🌙🕸️💀☣️🖤🔮 🌙⚰️🔮📟🦉☣️ 🌙☣️💀☣️ ☠️🕯️⚰️💀🌩️🌙🕯️ ⛓️🧪 ☣️🧪🦉📟🦇🦴 📟🌙 💀🕸️🔮🕯️💀🪦🧪 ☠️💀🪦 🕯️🦇🖤🌩️🦴💾📟☣️ 🔥🖤🔮📡🌙. ☣️💾🕯️ 📟🦇☣️🕯️🔮🦇💀🕸️ 🦇🕯️☣️🔥🖤🔮📡 💀🦇💀🕸️🧪🌙📟🌙 ⛓️🖤🦇📟☣️🖤🔮📟🦇🦴 ☣️🖤🖤🕸️ 📟 🔮💀🦇 🪦📟🪦🦇'☣️ 🕯️☢️🕯️🦇 🩸🕸️💀🦴 ☣️💾🕯️ ☣️🔮💀🦇🌙⛓️📟🌙🌙📟🖤🦇 💀🌙 💾📟🦴💾 🕯️🦇☣️🔮🖤🦉🧪. ☠️🌩️☣️ 📡🕯️🕯️🦉 ☣️💾🕯️ ⛓️🕯️🌙🌙💀🦴🕯️ ☠️🕸️🖤⚰️📡🌙 🌙⛓️💀🕸️🕸️. 📟🩸 🔥🕯️ 🌙🦉💀⛓️ 🕸️🖤🦇🦴 🦉💀🔮💀🦴🔮💀🦉💾🌙 📟🦇 ☣️💾📟🌙 🩸🖤🔮⛓️💀☣️, 💀🦇🧪🖤🦇🕯️ ⚰️💾🕯️⚰️📡📟🦇🦴 🩸🔮🕯️👁️🌩️🕯️🦇⚰️🧪 🪦📟🌙☣️🔮📟☠️🌩️☣️📟🖤🦇🌙 🔥📟🕸️🕸️ ⛓️💀🦉 ☣️💾🕯️ ⚰️💾💀🔮💀⚰️☣️🕯️🔮🌙🌙💾🖤🔮☣️ ☣️🔮💀🦇🌙⛓️📟🌙🌙📟🖤🦇🌙 🖤🦇🕸️🧪. 📟 🔥📟🕸️🕸️ 🦇🖤☣️📟🩸🧪 🧪🖤🌩️ 🔥📟☣️💾 🌩️🦉🪦💀☣️🕯️🌙🦴🕯️☣️ 🧪🖤🌩️🔮 🕸️🖤⚰️💀🕸️ 🌙⚰️🔮📟🦉☣️🌙 🔮🌩️🦇🦇📟🦇🦴 🦇🖤🔥. 📟 💀⛓️ 🦇🖤☣️ 🕸️🖤🖤📡📟🦇🦴 💀☣️ ⚰️🕸️🕯️💀🔮 ☣️🕯️🥀☣️ ⚰️💾💀🦇🦇🕯️🕸️🌙 💀🦇🧪⛓️🖤🔮🕯️"
chossen = {}
ciphertext = "🪦🕯️💀🪦🩸💀⚰️🕯️{🦉🕸️🕯️💀🌙🕯️_☣️🔮🧪_🖤🌩️☣️_⛓️🧪_🦇🕯️🔥_🌙☣️💀🦇🪦💀🔮🪦}"
message = message + " " + ciphertext
type_emoji = set(message)
print(len(type_emoji))

new_message = ""
count = 0
for emoji in message:
    if emoji in ["8","-",",","?",'️',"'","."," ","_","{","}"]:
        new_message += emoji
        continue
    if emoji not in chossen and alphabet[count] not in chossen.values() and emoji != '️':
        chossen = chossen | {emoji:alphabet[count]}
        count += 1
    try:
        new_message += chossen[emoji]
    except Exception:
        continue

print(new_message)
